import pandas as pd
import numpy as np

dates = pd.date_range('20160101',periods=6)
df = pd.DataFrame(np.arange(24).reshape(6,4),index = dates,columns=['A','B','C','D'])
''' print(df)
             A   B   C   D
2016-01-01   0   1   2   3
2016-01-02   4   5   6   7
2016-01-03   8   9  10  11
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23
'''
print(df['A'],df.A)
''' 两个方式一样
2016-01-01     0
2016-01-02     4
2016-01-03     8
2016-01-04    12
2016-01-05    16
2016-01-06    20
Freq: D, Name: A, dtype: int64 
'''
print(df[0:3],df['20160102':'20160105'])
'''df[0:3]
            A  B   C   D
2016-01-01  0  1   2   3
2016-01-02  4  5   6   7
2016-01-03  8  9  10  11 

df['20160102':'20160105']
            A   B   C   D
2016-01-02   4   5   6   7
2016-01-03   8   9  10  11
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19'''

#select by label:loc

print(df.loc['20160102'])
'''
A    4
B    5
C    6
D    7
Name: 2016-01-02 00:00:00, dtype: int64
'''
print(df.loc[:,['A','B']])
'''
             A   B
2016-01-01   0   1
2016-01-02   4   5
2016-01-03   8   9
2016-01-04  12  13
2016-01-05  16  17
2016-01-06  20  21
'''
print(df.loc['20160102',['A','B']])
'''
A    4
B    5
Name: 2016-01-02 00:00:00, dtype: int64
'''

#select by position : iloc
print(df.iloc[3])
'''
A    12
B    13
C    14
D    15
Name: 2016-01-04 00:00:00, dtype: int64
'''
print(df.iloc[3,1])
'''第三行第一列
13
'''
print(df.iloc[3:5,1:3])
'''
             B   C
2016-01-04  13  14
2016-01-05  17  18
'''

print(df.iloc[[1,3,5],1:3])
'''
             B   C
2016-01-02   5   6
2016-01-04  13  14
2016-01-06  21  22
'''

#mixed selection :ix
print(df.ix[:3,['A','C']])
'''
            A   C
2016-01-01  0   2
2016-01-02  4   6
2016-01-03  8  10
'''

#Boolean indexing

print(df[df.A > 8])
'''
             A   B   C   D
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23
'''








